Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh686-v3.tmx
Source language: bo
Languages: en

source: །ཞུགས་པ་ཙམ་ཁོ་ནས་ནགས་ཀྱི་གནས་རྣམ་པ་དྲུག་ཏུ་གཡོ་བར་འགྱུར་ཞིང་།
en: As soon as he enters, the residence in the grove will shake in six different ways.

source: དབུས་ཀྱི་ནགས་ཀྱི་མཐའ་ན་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་རྫིང་ལྷའི་ཆབ་དང་ས་ཤིང་རྙོག་པ་མ་མཆིས་པ་ཤིན་ཏུ་གསལ་བ་ལྷའི་ཙན་དན་གྱི་དྲི་དང་ལྡན་པ་ཧ་ཅང་མི་གྲང་བ་ཧ་ཅང་མི་དྲོ་བ་རེག་ན་བདེ་བ་རོ་དང་ལྡན་པ།
en: In the center of the area toward the end of the grove there will be a lotus pond, built with the seven types of jewels, whose water will have the divine fragrance of sandalwood and will be neither too cold nor too hot.

source: བདུད་རྩིའི་བཅུད་ཅན་མཆིས་ཏེ།
en: It will taste sweet when used for rinsing the mouth and will have the properties of the elixir of longevity. “

source: དེ་ལྟར་དོན་ཡོད་པའི་རྒྱལ་པོའི་སྙིང་པོ་ཡུངས་ཀར་ལ་ལན་ཉི་ཤུ་རྩ་གཅིག་བཟླས་བརྗོད་བགྱིས་ནས་རྫིང་གི་དབུས་སུ་ཞགས་པ་འཕང་བར་བགྱིའོ།
en: The vidyā holder should incant some mustard seeds with the heart mantra of Amogharāja twenty-one times and cast them into the center of the lotus pond.

source: །འཕངས་པ་ཙམ་གྱི་མོད་ལ་བུད་མེད་རིན་པོ་ཆེའི་གཟུགས་འདྲ་བ་ལྷའི་བུ་མོའི་ལུས་ཕྱེད་བྱུང་ནས། ལྷའི་མེ་ཏོག་རྣམ་པ་སྣ་ཚོགས་ཀྱིས་བརྒྱན་ཅིང་། རིན་པོ་ཆེ་སྣ་བདུན་གྱི་བུམ་པ་གང་བ་ཐོགས་ཏེ།
en: As soon as they are cast, a girl resembling the jewel of a woman will emerge from the pond, revealing the upper half of her body, holding a jar filled with the seven types of jewels, and adorned with divine flowers of various colors.

source: རིག་སྔགས་འཆང་ལ་དབུལ་ཞིང་སྤྱི་བོ་སྨད་དེ་འཛུམ་པ་དང་བཅས་པས་རིག་སྔགས་འཆང་ལ་སྨྲས་པ།
en: She will offer the jar to the vidyā holder.

source: རྗེ་བཙུན་རིག་སྔགས་འཆང་ཁྱོད་མ་བཞེངས་པར་གནས་སུ་ཞུགས་ཤིག །
en: With her head bowed low, she will say coyly, ‘May the venerable vidyā holder please enter the house without further delay!’

source: རིག་སྔགས་འཆང་གིས་གྲུབ་པའི་ཚིག་གསུམ་བརྗོད་པར་བགྱི་སྟེ། འཇིག་རྟེན་ཕ་རོལ་གྱི་དོན་དང་། རིག་སྔགས་འཆང་ཉིད་དང་། འཇིག་རྟེན་པའི་དངོས་གྲུབ་གྲུབ་སྟེ།
en: The vidyā holder can request three types of magical accomplishment—entry into the world beyond, the state of a vidyādhara, or the worldly accomplishments with their attendant pleasures.

source: བདག་ཉིད་ཀྱི་མ་དང་། སྲིང་མོ་དང་།
en: He can request the girl to be either his mother, sister, or servant.

source: མངག་གཞུག་མ་ཞེས་གར་བདེ་བར་བརྗོད་ལ་དེའི་འོག་ཏུ་རིག་སྔགས་འཆང་གིས་སྨྲ་བར་བགྱི་སྟེ།
en: He should say, ‘I would like to enter the other world.

source: སྲིང་མོ་ཁོ་བོ་ལ་འཇིག་རྟེན་ཕ་རོལ་གྱི་དོན་བྱིན་ཅིག་ཅེས་འཇུག་པར་བགྱིའོ།
en: Please grant it, sister, so that I may enter.’

source: །དེ་ཡང་རིག་སྔགས་འཆང་ཁྱོད་རང་གི་གནས་སུ་སྣོམས་ཏེ་ཞུགས་ཤིག་ཅེས་སྨྲ་བར་འགྱུར་རོ།
en: She will say, ‘Accept it, vidyā holder, and enter the house!’ “

source: །དེ་ནས་རིག་སྔགས་འཆང་གིས་ལག་པ་ཞགས་པའི་ཕྱག་རྒྱས་འཇུག་པར་བགྱི་ཞིང་། དོན་ཡོད་པའི་རྒྱལ་པོའི་སྙིང་པོ་བཟླས་སོ།
en: He should then display the noose mudrā with his hands and enter, reciting the heart mantra of Amogharāja.

source: །དེ་ནས་གནས་ཆེན་པོ་མཆོག་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་གཞལ་མེད་ཁང་ལྷའི་དྲིལ་བུ་གཡེར་ཁའི་དྲ་བ་དང་། གསེར་དང་།
en: The supreme great palace—constructed from the seven types of jewels and adorned with divine wind chimes, lattices, golden hangings, silken hangings, and garlands—will be open to view.

source: གོས་དཔྱངས་པ་དར་གྱི་ཆུན་འཕྱང་རབ་ཏུ་དཔྱངས་པར་གདའ་བ་ནས་བུ་མོ་དེ་ཡང་ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོ་ཐོགས་ཏེ། རིག་སྔགས་འཆང་འཇིག་རྟེན་ཕ་རོལ་གྱི་དོན་དུ་རིན་པོ་ཆེ་ཆེན་པོ་བཞེས་ཤིག་ཅེས་འབུལ་བར་བགྱིད་དོ།
en: The girl will offer the vidyā holder a great precious jewel, saying, ‘Accept this great precious gem, O vidyā holder, if you wish to enter the world beyond.’

source: །དེ་ནས་རིག་སྔགས་འཆང་གིས་སྟན་བཤམས་པའི་སྟེང་དུ་ཞགས་པ་ལེགས་པར་ཡོངས་སུ་བསྐྱིལ་ཏེ།
en: The vidyā holder should accept it and request a seat.

source: སྟན་དུ་བཏིང་ལ་ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོ་དེ་ཞགས་པའི་སྟེང་དུ་གཞག་ཅིང་མེ་ཏོག་དང་བདུག་པ་དབུལ་བར་བགྱིའོ།
en: Arranging the noose nicely into a circle, he should place it on the seat and place the great precious jewel on top of that. He should offer flowers and incense and then recite the heart mantra of Amogharāja. “

source: །དོན་ཡོད་རྒྱལ་པོའི་སྙིང་པོ་བཟླས་པར་བགྱིའོ། །བཟླས་པ་ཙམ་གྱི་མོད་ལ་ཞགས་པ་ནོར་བུ་རིན་པོ་ཆེ་དང་བཅས་ཏེ་འབར་བར་འགྱུར་རོ།
en: As soon as the mantra is recited, the noose and the great precious jewel will emit light.

source: །ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོ་དེ་ལས་ཀྱང་འོ་མའི་ཆབ་འབྱུང་བར་འགྱུར་རོ།
en: The jewel will also ooze milk.

source: །རིག་སྔགས་འཆང་གིས་འོ་མའི་ཆབ་དེ་ལས་བླངས་ལ་སྐྱོར་ཆུ་ལན་བདུན་དུ་རེག་པར་བགྱིའོ།
en: The vidyā holder should scoop the milk and sprinkle himself with seven handfuls of it.

source: །འོ་མའི་ཆབ་ཀྱིས་རེག་པ་ཙམ་གྱི་མོད་ལ་ལུས་ཐམས་ཅད་དྲི་མ་དང་བྲལ་ཞིང་ཡོངས་སུ་དག་པར་འགྱུར་རོ།
en: As soon as he sprinkles the milk, his entire body will become pure and immaculate.

source: །དོན་ཡོད་སྣང་བ་ནོར་བུ་གཞལ་མེད་ཀྱི་དཀྱིལ་འཁོར་གྱི་འོད་ཟེར་གྱི་དྲ་བ་འོད་ཟེར་ཞེས་བགྱི་བ་ཐོབ་ནས་ས་བཅུ་ལ་གནས་ཏེ་ཕྱིར་མི་ལྡོག་པར་འགྱུར་རོ།
en: It will acquire a glow that is called the wide circular aura of the effulgent amogha light.

source: །བླ་ན་མེད་པའི་བྱང་ཆུབ་ཀྱི་ལམ་འཐོབ་པར་འགྱུར་རོ།
en: He will be irreversibly established on the supreme path to awakening and progress through the ten bodhisattva levels.

source: །འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་ཏིང་ངེ་འཛིན་སྒྱུ་མ་ལྟ་བུར་རྣམ་པར་འཕྲུལ་པ་ཐོབ་པར་འགྱུར་ཞིང་།
en: He will obtain the mirage-like samādhi of Noble Avalokiteśvara with its magical displays. “

source: ཤིན་ཏུ་ཡོངས་སུ་དག་པའི་བདག་ཉིད་ཀྱི་རང་བཞིན་གྱིས་དོན་ཡོད་པའི་ཞགས་པའི་ཆ་ལུགས་འཆང་བ་རིག་སྔགས་འཆང་གི་མདུན་དུ་མཆིས་ནས། ལག་པ་གཡས་པ་སྤྱི་བོར་བཞག་སྟེང་འི་རིག་སྔགས་འཆང་གི་བུ་ཐུ་བོ་ཁྱོད་ཀྱིས་གྲོལ་བ་ཆེན་པོའི་དཀྱིལ་འཁོར་སངས་རྒྱས་ཀྱི་སྐུ་ཡོངས་སུ་དག་པ་འཐོབ་བོ། །ཞེས་དབུགས་འབྱིན་པར་འགྱུར་རོ།
en: Avalokiteśvara himself will appear before the vidyā holder in his completely pure true form wearing the attire of Amoghapāśa, place his right hand on his head, and give him comfort by saying, ‘You are my eldest son who has attained the state of vidyādhara with a completely pure body of a buddha in the great maṇḍala of liberation.’

source: །ཕྱོགས་བཅུའི་དེ་བཞིན་གཤེགས་པ་རྣམས་མཐོང་ནས་ཐམས་ཅད་ཀྱིས་ལེགས་སོ་ཞེས་བྱ་བའི་སྒྲ་འབྱིན་པར་འགྱུར་ཏེ།
en: The vidyā holder will see all the tathāgatas in the ten directions, who will all applaud him, saying, ‘Good!

source: སེམས་དཔའ་ཆེན་པོ་ལེགས་སོ་ལེགས། །ཁྱོད་ནི་བྱང་ཆུབ་ལམ་དུ་ཞུགས། །ཁྱོད་ཀྱིས་སངས་རྒྱས་ཉིད་འཐོབ་སྟེ།
en: Good it is, O great being, that you have entered and definitively established yourself on the path to awakening.’ “

source: །གྲོལ་བའི་ལམ་ཞེས་བྱ་བ་བསྒྲུབས།
en: This practice is known as the path to liberation. “

source: །འོན་ཏེ་རིག་སྔགས་འཆང་ཉིད་དོན་དུ་གཉེར་ན་དེའི་ཚེ་གསེར་གྱི་མེ་ཏོག་སྩོལ་བར་འགྱུར་ཏེ། བླངས་ལ་བུ་མོ་དེ་ཉིད་ཀྱི་སྤྱི་བོར་བཞག་ནས། ཨོཾ་ཞེས་བགྱི་བས་མནན་པར་བགྱིའོ།
en: If the vidyā holder wants to become a vidyādhara instead, he should offer golden flowers by taking them and placing them on the head of the girl while suppressing her with the syllable oṁ.

source: །ཨོཾ་ཞེས་བགྱི་བའི་སྒྲ་བརྗོད་ནས་སྤྱི་བོར་བཞག་པ་ཙམ་གྱི་མོད་ལ་བུ་མོ་དེའི་མིག་མཆོག་གཉིས་ནས་མཆི་མ་འཛག་པར་འགྱུར་རོ།
en: As soon as the syllable is positioned upright and its sound clearly pronounced, the girl’s beautiful eyes will overflow with tears.

source: །དེ་ནས་རིག་སྔགས་འཆང་གིས་བླངས་ཏེ་ཉེ་རེག་བགྱིའོ།
en: The vidyā holder should collect the teardrops and sprinkle himself.

source: །ཉེ་རེག་བགྱིས་པ་ཙམ་གྱི་མོད་ལ་རིག་སྔགས་འཆང་གི་འཁོར་ལོས་སྒྱུར་བར་འགྱུར་རོ།
en: As soon as he does, he will become an emperor of the vidyādharas.

source: །སྐྲ་ཅུང་ཟད་འཁྱིལ་ཞིང་ལག་པ་ན་འཁོར་ལོའི་ཞགས་པ་ཐོགས་ཏེ་ནམ་མཁའ་ལ་མཆི་བར་འགྱུར་རོ། །རིག་སྔགས་འཆང་བྱེ་བ་འབུམ་ཕྲག་བཅྭ་བརྒྱད་ཀྱིས་ཡོངས་སུ་བསྐོར་བར་འགྱུར་རོ།
en: His hair will become curly, and he will travel through space with the wheel noose in his hand, surrounded by a retinue of one trillion eight hundred billion vidyādharas.

source: །ཚེ་ལོ་དྲུག་ཁྲི་ཉིས་སྟོང་དུ་འགྱུར་ཞིང་སྐྱེ་བར་བདུན་སྟོང་རྗེས་སུ་དྲན་པར་འགྱུར་རོ།
en: He will be able to recall seven thousand of his former births. “This is the vidyādhara practice. “

source: །འོན་ཏེ་གསང་སྔགས་འཆང་འཇིག་རྟེན་པའི་དངོས་གྲུབ་ཀྱི་ཆོ་ག་སློང་ན་དེའི་ཚེ་འདི་ལྟ་བུར་འགྱུར་ཏེ། རིག་སྔགས་འཆང་གིས་བདག་གི་སྐྲ་འདི་སྡོམས་ཤིག་ཅེས་དེའི་ཚེ་བུད་མེད་དེས་སྐྲའི་རལ་པ་བཏོན་ནས།
en: Alternatively, the girl may offer the vidyā holder the procedure for worldly practice, in which case she will say, ‘Accept my hair, vidyā holder.’

source: རིག་སྔགས་འཆང་ལ་འབུལ་བ་ན།
en: She will then cut off her topknot and give it to him.

source: སྐྲ་ཐམས་ཅད་བླངས་ཏེ་དུམ་བུ་གསུམ་དུ་བཀུག་ནས་སྲད་བུ་ལ་མདུང་པ་ཉི་ཤུ་རྩ་གཅིག་བགྱི་སྟེ།
en: He should take all of it and use it to make a plait with three strands. He should make twenty-one knots in it and tie the plait around his head.

source: གཅིག་བཀལ་ཏེ། མགོ་ལ་བཏགས་པས་ནི་ཇི་ལྟར་ཡིད་ལ་བསམས་པ་དེ་བཞིན་དུ་མིག་འཕྲུལ་སྟོན་པར་འགྱུར།
en: Whatever he thinks about will manifest as a magical display.

source: འབྲས་བུ་དང་མེ་ཏོག་འཚལ་བ་ཐམས་ཅད་སྟོན་པར་འགྱུར། བདེན་པ་ཇི་ལྟར་འཚལ་བ་བཞིན་སྟོན་པར་འགྱུར་རོ། །མགུལ་དུ་བཏགས་པས་ནི་མི་གདའ་བར་གྱུར་ནས། གནོད་སྦྱིན་དང་།
en: He will be able to conjure at will all the flowers and fruits he desires, and he will cause whatever he desires to appear in reality.

source: སྲིན་པོ་དང་།
en: If he ties the plait around his neck, he will become invisible.

source: འབྱུང་པོ་དང་། ཤ་ཟ་དང་། གྲུལ་བུམ་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། མི་མ་ཡིན་པ་རྣམས་དབང་དུ་གྱུར་ནས་མཆིས་པར་འགྱུར་རོ།
en: All yakṣas, rākṣasas, bhūtas, piśācas, kumbhāṇḍas, mahoragas, and humans will come under his control.

source: །དཔྲལ་བ་ལ་བཏགས་པས་ནི་ལྷ་དང་ཀླུ་ཐམས་ཅད་དབང་དུ་གྱུར་ནས་མཆིས་པར་འགྱུར་རོ།
en: If he ties the plait around his forehead, all devas and nāgas will come under his control.

source: །དཔུང་པ་གཡས་པ་ལ་བཏགས་པས་ནི་གླང་པོ་ཆེ་བཅུའི་སྟོབས་དང་ལྡན་པར་འགྱུར་ཏེ། ཕས་ཀྱི་དགྲ་བོ་དང་མི་མཛའ་བ་དང་། གདུག་པ་ཐམས་ཅད་ཀྱིས་མི་ཚུགས་པས་སྟོབས་ཀྱིས་འཁོར་ལོས་སྒྱུར་བར་འགྱུར་རོ།
en: If he ties it around his right arm, he will have the strength of ten elephants and be unassailable by armies or any wicked opponents and adversaries. “

source: །དཔུང་པ་གཡོན་པ་ལ་བཏགས་པས་ནི་རིགས་བཞིའི་འཇིག་རྟེན་དབང་དུ་གྱུར་ནས་མཆིས་པར་འགྱུར་རོ།
en: If he ties the plait around his left arm, all the members of the four castes will come to him and remain under his thrall.

source: །ལག་པ་གཡོན་པ་ལ་བཏགས་པས་ནི་གང་ལ་རེག་པ་དེ་དབང་དུ་འགྱུར་ཞིང་། བདག་གི་ནོར་དུ་འགྱུར་རོ།
en: If he ties the plait around his left hand, whomever he touches will fall under his thrall and place themselves and their wealth at the vidyā holder’s disposal.

source: །ལག་པ་གཡས་པ་ལ་བཏགས་པས་ནི་གྲོང་ཁྱེར་གྱི་ཤར་ཕྱོགས་ཀྱི་སྒོ་ནས་རྒྱལ་པོའི་སྒོ་ལ་ཐལ་མོ་ལན་གསུམ་བརྡབས་ན་རྒྱལ་པོའི་བཙུན་མོ་འཁོར་དང་བཅས་པ་དང་། གྲོང་ཁྱེར་དང་། ཡུལ་འཁོར་དང་། རྒྱལ་པོའི་ཕོ་བྲང་དང་། བུད་མེད་དང་། སྐྱེས་པ་དང་།
en: If he ties the plait around his right hand and knocks at the eastern gate of the city three times, he will bring the king, his harem, and his retinue, as well as the capital city with all its women, men, boys, and girls, under his thrall.

source: ཁྱེའུ་དང་། བུ་མོ་དང་བཅས་པ་བདག་ཉིད་དམ། ནོར་དབང་དུ་གྱུར་ནས་མཆིས་པར་འགྱུར་རོ།
en: They will place themselves and their wealth at the vidyā holder’s disposal.

source: །ཐ་ན་དུད་འགྲོའི་སྐྱེ་གནས་སུ་གཏོགས་པར་བྱ་དང་། གཅན་གཟན་དང་། རི་དགས་དང་། གདུག་པ་དང་། གཞན་ཡང་གདུག་པ་དང་བཅས་པའི་སྲོག་ཆགས་རྣམས་དབང་དུ་གྱུར་ནས་མཆིས་པར་འགྱུར་རོ། །བརླ་གཡས་པ་ལ་བཏགས་པས་ནི་ཚལ་ལམ། སེར་གའམ། རི་འོར་རམ། ཕུག་གམ།
en: All animals and birds, both carnivorous and herbivorous, venomous snakes, and other venomous creatures that are in his vicinity will come under his control.

source: དགོན་པའམ། བསྟི་གནས་གང་དུ་ཞུགས་ཏེ། ཞུགས་པ་ཙམ་གྱི་མོད་ལ་ནོར་ཐམས་ཅད་དང་། སྨན་ཐམས་ཅད་དང་། ལྷ་ཐམས་ཅད་རང་གི་གཟུགས་སུ་མདུན་དུ་མཆིས་པར་འགྱུར་རོ།
en: If he ties the plait around his right thigh, all medicinal substances and herbs, and all the deities that live in the forests, crevices, mountain wildernesses, caves, or forest dwellings that he enters will appear before him in their respective forms as soon as he enters there. “

source: །བྱིན་པ་གཡས་པ་དང་། རྐང་པ་གཡས་པ་ལ་བཏགས་པས་ནི། རྒྱ་མཚོ་ཆེན་པོའི་ཕ་མཐར་ཡང་རྒལ་བར་འགྱུར་ན་ཆུ་ཀླུང་ཆེན་པོའི་ཆབ་ཀྱིས་བྱིན་པ་ནུབ་ཙམ་དུ་འགྱུར་བ་ལྟ་སྨོས་ཀྱང་ཅི་འཚལ།
en: If he ties the plait around his right foot or right calf, he will cross the great ocean by foot, not to mention the great rivers. The water will be just knee-deep.

source: བྱིན་པ་གཡོན་པ་ལ་བཏགས་པས་ནི། ཉི་མ་རེ་རེ་བཞིན་དཔག་ཚད་བརྒྱར་ཕྱིན་ནས། དུབ་པ་མ་མཆིས་པར་སླར་ཡང་ལྡོག་པར་འགྱུར་རོ།
en: If he ties the plait around his left foot, he will be able to travel one hundred leagues every single day and return without getting tired.

source: །བརླ་གཡོན་པ་ལ་བཏགས་ནས་དུར་ཁྲོད་ཆེན་པོར་ཞུགས་ན་དུར་ཁྲོད་ཐམས་ཅད་ན་གནས་པའི་གཅེར་བུ་པ་ཐམས་ཅད་དབང་དུ་གྱུར་ནས་མཆིས་པར་འགྱུར་རོ།
en: If he ties it around his left thigh and subsequently enters a great charnel ground, all the beings who live there will become naked and remain under his thrall. “

source: །དེ་ནས་རིག་སྔགས་འཆང་གནས་དེ་ཉིད་ན་སྤྱོད་ན་རིག་སྔགས་འཆང་དེས་ལག་པ་གཡོན་པས་བུམ་པ་གང་བ་བཟུང་ཞིང་། ལག་པ་གཡས་པས་བུད་མེད་དེ་བཟུང་ནས། གནས་ཆེན་པོའི་མཆོག་ཏུ་འཇུག་པར་བགྱིའོ།
en: If he wants to have sex right there in the palace, he should grasp the full jar with his left hand, and the girl with the right, and enter this great supreme dwelling.

source: །གནས་མཆོག་དེའི་དབུས་ན་རྫིང་མེ་ཏོག་གི་ཚལ་པར་བཀྲམ་པར་བགྱི་སྟེ།
en: That supreme place will have a lotus pond in the center that is strewn with flowers.

source: རྫིང་དེར་གཉིས་ཀ་ཁྲུས་བགྱི་ཞིང་ཆབ་ཀྱིས་ཉེ་རེག་བགྱིའོ།
en: They both should bathe in that lotus pond and splash in the water.

source: །བཀྲུས་ཤིང་རེག་པ་ཙམ་ཁོ་ནས། འཁོར་ལོའི་རིག་སྔགས་འཆང་ཞགས་པ་དང་། འཁོར་ལོས་སྒྱུར་བའི་རིག་སྔགས་འཆང་དུ་འགྱུར་རོ།
en: As soon as he has bathed and performed his ablutions, the vidyā holder will become the emperor of vidyādharas with the wheel and the noose.

source: །རིག་སྔགས་འཆང་འབུམ་ཕྲག་བདུན་སྟོང་གིས་ཡོངས་སུ་བསྐོར་ཅིང་ཚེ་བསྐལ་པ་ཁྲིར་འགྱུར་རོ།
en: He will have a retinue of seven billion vidyādharas and will live ten thousand eons.

source: །སྐྲ་ཅུང་ཟད་འཁྱིལ་པར་ཡང་འགྱུར་རོ། །ནགས་ཀྱི་གནས་ཀྱི་གཞལ་མེད་ཁང་བདུན་ཅུ་རྩ་གཉིས་ཀྱི་དཔོན་པོ་རྒྱལ་པོར་འགྱུར་རོ། །གལ་ཏེ་མ་ཞེས་བགྱི་བས་དོན་དུ་གཉེར་ན་ནི་བུ་གཅིག་པ་བཞིན་ཡོངས་སུ་སྐྱོང་བར་འགྱུར་རོ། །འབྲས་དང་།
en: His hair will become wavy and curly, and he will be the master of eight hundred forty palatial dwellings in the grove. “

source: འབྲུ་དང་། གོས་དང་། ཆས་དང་། ནོར་བུ་དང་། མུ་ཏིག་དང་།
en: If he requests the girl to be his mother, she will care for him as if for her own son, and will procure money, grain, clothes, ornaments, precious stones, pearls, coral, silver, and gold for him.

source: བྱི་རུ་དང་། གསེར་དང་། དངུལ་ཡོངས་སུ་འགྲུབ་པར་བགྱིད་དོ། །སྲིང་མོ་ཞེས་བགྱི་བས་ནི་དགོས་པའི་ཡོ་བྱད་ཐམས་ཅད་ཚང་བར་སྟོབས་པར་འགྱུར་ཞིང་ཡན་ལག་སྤོང་བར་བགྱིད་དོ།
en: If he requests her to be his sister, she will provide all supplies and services without any hesitation and will not neglect any detail.

source: །ཉི་མ་རེ་རེ་ཞིང་རྒྱན་ཐམས་ཅད་ཀྱིས་བཀླུབས་པའི་ལྷའི་བུ་མོ་ཁྲིད་ནས་མཆི་བར་འགྱུར། ལྷའི་གཞལ་མེད་ཁང་འབྱོར་པ་སྟོབས་པར་བགྱིད། ལྷའི་ཁྱིམ་དང་།
en: Every single day she will procure a divinely-adorned celestial woman and arrange for heavenly delights in palatial mansions.

source: གཞལ་མེད་ཁང་སྟོབས་པར་བགྱིད་དོ། །མངག་གཞུག་མ་ཞེས་བགྱི་བ་ནི།
en: She will provide a heavenly residential palace.

source: གང་དང་གང་དུ་མངག་པ་དེ་དང་དེར་མཆི་བར་འགྱུར་ཏེ། ལྷའི་གནས་སམ། ཀླུའི་གནས་སམ། གནོད་སྦྱིན་གྱི་གནས་སམ། སྲིན་པོའི་གནས་སམ།
en: When dispatched, she will go wherever she is asked to go, whether it is to the palaces of the devas, nāgas, yakṣas, rākṣasas, or bhūtas.

source: འབྱུང་པོའི་གནས་སམ། གཞན་ཡང་མངག་གཞུག་པའི་སྒྲུབ་པ་རྣམ་པ་སྣ་ཚོགས་ཡིད་ལ་བསམས་པ་བཞིན་བགྱིད་དོ།
en: She will perform whatever other tasks come to the vidyā holder’s mind and are assigned to her. “

source: །ནགས་སྒྲུབ་པའི་ཆོ་གའོ།། །།
en: This was the practice procedure of the grove. “

source: དེ་ནས་རིག་སྔགས་འཆང་ཐང་ལ་རྒྱུ་བར་འཚལ་ན། གཙང་མ་ཁྲུས་བགྱིས་པས་གོས་གཙང་མ་བགོ་བར་བགྱི། གནས་དབེན་པ་གཙང་མའི་ས་ཕྱོགས་སུ་དཀྱིལ་འཁོར་གྲུ་བཞིར་བྲིས་ལ།
en: If the vidyā holder wants to enter subterranean paradises, he should clean himself, bathe, put on clean clothes, and draw a four-sided maṇḍala in a hidden place on a clean patch of ground.

source: དྲི་སྣ་ཚོགས་ཀྱིས་བྱུག །རོ་སྣ་ཚོགས་དང་ལྡན་པའི་གཏོར་མ་བཤམས་ལ།
en: He should smear the maṇḍala with various fragrances, arrange a bali offering of various tastes, and burn agarwood incense.

source: ཨ་ག་རུའི་བདུག་པ་བསྲེགས་ཏེ་ནུབ་གསུམ་དུ་མཆིས་ནས་འཁོར་ལོ་ཞགས་པའི་ལག་པའི་ཕྱག་རྒྱས་དོན་ཡོད་རྒྱལ་པོའི་སྙིང་པོའི་བཟླས་བརྗོད་སྟོང་རྩ་བརྒྱད་བགྱིས་ཏེ།
en: After fasting for three days and three nights, he should recite the heart mantra of Amogharāja one thousand and eight times while displaying the hand mudrā of the wheel noose.

source: ལན་སྟོང་རྩ་བརྒྱད་ཚང་བ་དང་། དཀྱིལ་འཁོར་གྱི་དབུས་ནས་དུ་བ་འབྱུང་བར་འགྱུར་ཏེ།
en: When he has reached the number one thousand and eight, incense smoke will issue forth from the center of the maṇḍala.

source: ཁྲོ་བོའི་རྒྱལ་པོ་ལན་བདུན་བཟླས་པར་བགྱིའོ།
en: He should then recite the mantra of Krodharāja seven times.

source: །དེ་ནས་དཀྱིལ་འཁོར་གྱི་དབུས་ནས་སྐྱེས་པ་ནག་པོ་ཆེན་པོའི་ཚུལ་མི་སྡུག་པ།
en: When this is done, a huge, black-colored man will emerge from inside the maṇḍala, exposing the upper half of his body.

source: མཆེ་བ་གཙིགས་པ། སྐྲ་གྱེན་དུ་བསྒྲེང་བ། མགོ་འབར་བ།
en: He will be grimacing, bearing his fangs, and his hair will flow upward from his blazing head.

source: མིག་དམར་བ། མཆུ་དང་ལྕེ་དམར་བ། སེན་མོ་དམར་བ། སྐྲ་སྔོ་བ། དཔུང་པ་མཁྲང་ཞིང་བརྟན་པ།
en: He will have red eyes, a red tongue and lips, red fingernails, blue hair, firm and taut arms, and a protruding belly.

source: གསུས་པ་འཕྱངས་པོ་མཆོད་ཕྱིར་ཐོགས་པ་དང་ལྡན་པ། མགོ་ལྔ་པ་སྦྲུལ་ལྟར་ལྕེ་བསྒྱུར་བ།
en: He will wear a white sacred cord, have a five-headed venomous snake above his head, and have a lolling tongue.

source: སྟག་གི་ཤམ་ཐབས་བགོས་པ། ལག་པ་ན་དགྲ་སྟ་དང་།
en: He will be clad in a tiger’s skin and hold an axe and a bell in his hands.

source: དྲིལ་བུ་ཐོགས་པ་ཞིག་ལུས་ཕྱེད་ཙམ་ཕྱུང་ནས་ཕྱོགས་བཅུར་ལྟ་བར་བྱེད་དོ།
en: He will cast glances in the ten directions. “

source: །དེ་ནས་རིག་སྔགས་འཆང་གིས་སྐྲག་པར་མི་བགྱི་སྟེ། བརྟན་པར་བགྱིས་ལ། ཁྲོ་བོའི་རྒྱལ་པོ་བཟླས་ནས།
en: The vidyā holder should not be afraid at this time, but should remain steadfast and recite the Krodharāja.

source: འཁོར་ལོའི་ཞགས་པ་འཕངས་ཏེ་མགོ་བཅད་ལ་ཁྲག་མང་དུ་བྱུང་བ་དང་།
en: He should cast the wheel noose and cut off the head of the black-colored man.

source: རིག་སྔགས་འཆང་གིས་ཁྲག་དེས་ལུས་ཐམས་ཅད་བྱུག་པར་བགྱིའོ།
en: A lot of blood will gush out, which he should smear all over his body.

source: །བྱུགས་པ་ཙམ་གྱི་མོད་ལ་བདག་ཉིད་ཀྱི་ལུས་མི་ཆོད་པ་དང་། མི་ཤིགས་པས་རྡོ་རྗེར་བྱིན་གྱིས་བརླབས་པར་འགྱུར་རོ།
en: As soon as he does this, his body will turn into an unbreakable and infrangible vajra.

source: །མིག་གཉིས་ཕྱུང་ལ་རང་གི་མིག་ཕྱིས་ནས་མིག་ལ་བསྐུས་ན་ལྷའི་མིག་ཏུ་འགྱུར་རོ།
en: Having gouged out the eyes from the severed head, the vidyā holder should anoint his own eyes by rubbing them with the gouged eyeballs. He will then obtain the divine eye.

source: །རྐང་བྲུས་ཏེ་བྱུགས་ན་ཚེ་བསྐལ་པ་བཅུར་འགྱུར་ཞིང་ཐོས་པ་བསགས་པའི་རྒྱ་མཚོར་འགྱུར།
en: Having extracted the bone marrow from the corpse, he should sprinkle it over himself; his lifespan will increase to ten thousand eons. He will become an ocean-like receptacle of sacred knowledge.

source: བསྐལ་པ་བརྒྱ་སྟོང་གི་སྐྱེ་བའི་སྐྱེ་བ་དང་། ཚེ་རབས་དྲན་པར་འགྱུར་རོ།
en: He will remember his former births stretching back for hundreds of thousands of eons.

source: །སྙིང་ཕྱུང་སྟེ་འཚལ་ན་ནམ་མཁའ་ལ་མཆིའོ།
en: If he eats a little bit of the corpse’s heart, he will travel through space.

source: །ཁྲག་གིས་སྙིང་གར་ཐིག་ལེ་བགྱིས་ན་མི་གདའ་བར་འགྱུར་རོ།
en: If he makes a bindi on his chest with the blood from the corpse, he will become invisible.

source: །ལྕེ་བཅད་ན་རལ་གྲིར་གྱུར་ནས་དགྲ་ཐམས་ཅད་བརླག་པར་བགྱིད་དོ།
en: If he cuts out the corpse’s tongue, it will turn into a sword that can be used to destroy all enemies. “

source: །གལ་ཏེ་ཐང་ལ་རྒྱུ་བར་འཚལ་ན། དེའི་ཚེ་ཁྲོ་བོའི་རྒྱལ་པོ་ལན་བརྒྱ་རྩ་བརྒྱད་ཞགས་པ་དང་འཁོར་ལོ་ལ་བཟླས་བརྗོད་བགྱིའི། །འཁོར་ལོ་ཞགས་པ་གསང་བའི་ཕྱག་རྒྱའི་ཚུལ་གྱིས་ཐལ་མོ་ས་ལ་བརྡབ་པར་བགྱི་སྟེ། ལན་གསུམ་དུ་ཐལ་མོ་བརྡབས་པ་དང་།
en: If the vidyā holder wants to enter subterranean paradises, he should incant the wheel noose with the Krodharāja one hundred and eight times, grasp the noose with the hand displaying the mudrā, and strike the earth three times with the wheel.

source: དེའི་འོག་ཏུ་ཐང་གི་སྒོ་དབྱེ་བར་འགྱུར་རོ། །ཅི་ལྟར་རང་གི་ཁྱིམ་བཞིན་དུ་འཇུག་པར་བགྱི་སྟེ།
en: The gates to the subterranean paradise will fall open, and he should enter as if he were entering his own house.

source: ཞུགས་ནས་སླར་ཡང་མཆི་ཞིང་དགོས་པ་གཞན་ཐམས་ཅད་བགྱིད་པ་དང་ཐད་ཐམས་ཅད་ལ་གནས་པ་ཐམས་ཅད་དབང་དུ་གྱུར་ནས་གནས་པར་འགྱུར་རོ།
en: He will be able to visit it repeatedly and perform any other task. All the inhabitants of the paradise will fall under his thrall. “

source: །འོན་ཏེ་ནམ་མཁའ་ལ་མཆི་བར་འཚལ་ན་གྱེན་དུ་བལྟས་ནས། དོན་ཡོད་པའི་རྒྱལ་པོའི་སྙིང་པོ་ཡུངས་མར་ལ་ལན་སྟོང་རྩ་བརྒྱད་བཟླས་ཏེ། ལན་སྟོང་རྩ་བརྒྱད་བཟླས་ནས།
en: If, after that, he wants to travel through space, he should direct his gaze upward and recite the heart mantra of Amogharāja one thousand and eight times.

source: བདག་ཉིད་ལ་བྱུགས་ཏེ།
en: He should smear his body with mustard oil incanted just as many times.

source: ལག་པའི་ཞགས་པའི་ཕྱག་རྒྱས་ནམ་མཁའ་ལ་མཆི་བར་འགྱུར་ཞིང་ནམ་མཁའི་གོ་འབྱེད་པར་འགྱུར་རོ། །ལྷའི་གནས་སུ་མཆི་བར་འཚལ་ན།
en: By forming the hand mudrā of the noose, he will ascend to the firmament of the sky and remain there suspended in space.

source: ལྷའི་ཁྱིམ་དུ་མཆིས་ནས་ཞགས་པས་ལྷའི་མགུལ་ནས་བཅིང་བར་བགྱི་ཞིང་དོན་ཡོད་རྒྱལ་པོའི་སྙིང་པོ་ལན་སྟོང་རྩ་བརྒྱད་བཟླས་ནས།
en: If he wishes to enter the palace of a god, he should go to a temple, stand by the side of the god, and tie the noose around the god’s neck. He should recite the heart mantra of Amogharāja one thousand and eight times.

source: ལྷ་བཅིངས་པ་གང་ཡིན་པ་དེའི་མིང་ནས་བརྗོད་ན་ལྷ་དེ་བབས་ནས་རིག་སྔགས་འཆང་གི་མདུན་ན་མཆིས་པར་འགྱུར་རོ། །ཚངས་པ་དང་། ཁྱབ་འཇུག་དང་།
en: The god whom he ties and whose name he recalls will descend to earth and stand before him.

source: དབང་ཕྱུག་ཆེན་པོ་རིག་སྔགས་འཆང་ལ་རིག་སྔགས་འཆང་ཅི་ཞིག་དོན་དུ་གཉེར་བ་དེ་སྣོམས་ཤིག་ཅེས་སྨྲ་བར་འགྱུར་རོ།
en: Whether it is Brahmā, Viṣṇu, or Maheśvara, he will say to the vidyā holder, ‘I will grant whatever you wish for, O vidyā holder.’

source: །རིག་སྔགས་འཆང་གིས་ལྷའི་གནས་སུ་འགྲོའོ་ཞེས་བརྗོད་པར་བགྱིའོ།
en: The vidyā holder should reply, ‘I intend to visit the god’s palace.’

source: །གལ་ཏེ་གཞན་བསམས་པ་ཞིག་མཆིས་ན་མཆོག་ཐམས་ཅད་སྩོལ་བར་བགྱིད་དོ།
en: That god will also grant any other boons he might wish for. “

source: །དེ་ནས་ལྷའི་གནས་ནས་མཆི་བ་ན།
en: The vidyā holder will then go to the abode of the god.

source: ལྷའི་གནས་ལྷའི་རྫུ་འཕྲུལ་གྱིས་ལག་པ་ན་ཐོགས་ཏེ། ནམ་མཁའ་ལ་མཆི་བར་འགྱུར་རོ། །ཅི་སྲིད་འཚལ་བར་ལྷའི་གཞལ་མེད་ཁང་ཆེན་པོར་ལོངས་སྤྱོད་པར་འགྱུར་ཞིང་།
en: Held by the hand, he will, by the god’s magical power, ascend through space up to the god’s abode, and he will enjoy himself to his heart’s content in the great celestial mansion.

source: འོན་ཏེ་མི་འཚལ་ན་ལྷའི་གནས་ནས་སླར་ཡང་འབབ་པར་འགྱུར་རོ།
en: When he has had enough, he can leave the god’s abode and descend back to earth.

source: །གཞན་ཅི་ལྟར་རང་གི་བློ་གྲོས་དང་། ཡིད་ལ་བསམས་པའི་དགོས་པ་ཐམས་ཅད་བགྱིད་པར་འགྱུར་ཞིང་ཐམས་ཅད་དུ་གྲུབ་པར་འགྱུར་ཏེ། དེ་ལ་སོམ་ཉི་དང་ཡིད་གཉིས་བསྐྱེད་པར་མི་བགྱིའོ།
en: Any other wishes that he may have or tasks that he wants performed will be accomplished in full; one should not harbor any doubts or uncertainties about it. “

source: །འཁོར་ལོའི་ཞགས་པ་སྒྲུབ་པའི་ཆོ་གའོ།། །།
en: These are the ritual procedures for the practice of the wheel noose. “

source: དེ་ནས་རིག་སྔགས་འཆང་པདྨའི་ཞགས་པ་སྒྲུབ་པར་འཚལ་བས། རིག་སྔགས་འཆང་དེ་གཙང་མ་ལེགས་པར་བཀྲུས་ཏེ་གོས་གཙང་མ་བགོ་བར་བགྱིའོ། །ནུབ་གསུམ་མཆིས་སམ། ནུབ་ལྔ་མཆིས་སམ། ནུབ་གཅིག་མཆིས་ནས་རིག་སྔགས་འཆང་གིས་ཞགས་པའི་སྐུད་པ་བསྒྲུབ་པར་བགྱི་སྟེ།
en: If the vidyā holder wants to accomplish the practice of the lotus noose, he should bathe, put on clean clothes, and fast for either three, five, or a single day and night.
